{
  "about_me": "Über mich",
  "skills": "Fähigkeiten",
  "contact": "Kontakt",
  "legal_notice": "Impressum",
  "job_title": "Frontend Entwickler",
  "lets_talk": "Kontakt!",
  "scroll_down": "scroll runter",
  "intro_line1": "Hallo, ich bin Frontend-Entwickler und wohne in der Nähe von",
  "intro_line2": "Mönchengladbach. Motiviert durch die grenzenlosen Möglichkeiten",
  "intro_line3": "im IT-Bereich freue ich mich darauf, optisch fesselnde",
  "intro_line4": "Anwendungen und intuitive Websites zu schaffen.",
  "location_line1": "Ich bin in der Lage, sowohl in Mönchengladbach ",
  "location_line2": "und Umgebung als auch von zu Hause",
  "location_line3": "aus effektiv zu arbeiten.",
  "bulb_line1": "Ich bin aufgeschlossen und auf der Suche",
  "bulb_line2": "nach persönlichen Herausforderungen, um meine",
  "bulb_line3": "Kenntnisse und Fähigkeiten ständig zu verbessern.",
  "puzzle_line1": "Meine berufliche Tätigkeit umfasst nicht nur das",
  "puzzle_line2": "Programmieren von Code, sondern stellt eine kreative Form",
  "puzzle_line3": "der Problemlösung dar. Ich bin stolz auf meine Fähigkeit,",
  "puzzle_line4": "komplexe technische Herausforderungen in einfache,",
  "puzzle_line5": "benutzerfreundliche Lösungen zu transformieren. Auf diese Weise trage",
  "puzzle_line6": "ich dazu bei, Ihre Ziele zu erreichen und Ihre Visionen zum Leben zu erwecken.",
  "learning": "Derzeit bilde ich mich im Bereich Backend weiter, um ein Full-Stack-Entwickler zu werden.",
  "my_skills": "Meine Fähigkeiten",
  "skills_intro_line1": "Ich habe Erfahrung in der Erstellung von Projekten mit verschiedenen",
  "skills_intro_line2": "Frontend-Technologien und -Konzepten gesammelt.",
  "looking_for": "Suchen Sie nach einer",
  "another_skill": "weiteren Fähigkeit",
  "learn_more_line1": "Zögern Sie nicht, mich zu kontaktieren. Ich freue mich darauf,",
  "learn_more_line2": "mein bisheriges Wissen weiter auszubauen.",
  "get_in_touch": "Kontakt",
  "portfolio_explore": "Entdecken Sie hier eine Auswahl meiner Arbeiten – interagieren Sie mit den Projekten, um meine Fähigkeiten in Aktion zu erleben.",
  "portfolio": {
    "join": {
      "description": "Ein vom Kanban-System inspirierter Task-Manager. Aufgaben erstellen und organisieren mit Drag-and-Drop-Funktionen, Benutzer und Kategorien zuweisen."
    },
    "medieval_hunt": {
      "description": "Ein einfaches Jump-and-Run-Spiel basierend auf einem objektorientierten Ansatz. Hilf dem Magier, die Münzen zu sammeln und seinen Weg zum Ziel zu finden. Achte auf dein Mana, sonst wird es schwierig, den Boss zu besiegen."
    }
  },
  "contact_h2": "Haben Sie ein Problem, das gelöst werden muss?",
  "contact_me_line1": "Kontaktieren Sie mich über dieses Formular. Ich freue mich ",
  "contact_me_line2": "darauf, von Ihnen zu hören, Ihre Ideen kennenzulernen und",
  "contact_me_line3": "mit meiner Arbeit zu Ihren Projekten beizutragen.",
  "contact_me_line4": "Sie suchen einen Frontend-Entwickler?",
  "contact_me": "Kontaktieren Sie mich!",
  "contact_form_name": "Ihr Name",
  "contact_form_name_required": "Ihr Name ist erforderlich!",
  "contact_form_email": "Ihre E-Mail-Adresse",
  "contact_form_email_required": "Ihre E-Mail-Adresse ist erforderlich!",
  "contact_form_message": "Ihre Nachricht",
  "contact_form_message_required": "Ihre Nachricht ist leer!",
  "privacy_policy_before": "Ich habe die",
  "privacy_policy": "Datenschutzerklärung",
  "privacy_policy_after": "gelesen und stimme der Verarbeitung meiner Daten gemäß den darin beschriebenen Bedingungen zu.",
  "privacy_policy_required": "Bitte stimmen Sie der Datenschutzerklärung zu!",
  "submit_btn": "Nachricht senden",
  "message_response": "Nachricht erfolgreich versendet.",
  "legal_notice_h1": "Information gemäß § 5 TMG (Telemediengesetz)",
  "legal_notice_h2": "Inhaber & Verantwortlich für den Inhalt:",
  "legal_notice_location": "Deutschland",
  "legal_notice_contact_info": "Kontaktinformationen:",
  "legal_notice_phone": "Telefon: +49 173 4216923",
  "legal_notice_h2_info": "Haftungsausschluss:",
  "legal_notice_info_line1": "Diese Website ist Teil eines persönlichen Portfolios und dient ausschließlich der Präsentation",
  "legal_notice_info_line2": "professioneller Projekte und Erfahrungen. Trotz sorgfältiger Prüfung übernehme ich keine Haftung",
  "legal_notice_info_line3": "für externe Links oder für Inhalte, die möglicherweise veraltet, unvollständig oder fehlerhaft sind.",
  "legal_notice_info_line4": "Links zu Websites Dritter werden ausschließlich zu Informationszwecken bereitgestellt; die",
  "legal_notice_info_line5": "Verantwortung für diese externen Websites liegt bei den jeweiligen Betreibern.",
  "legal_notice_h2_copyright": "Urheberrecht:",
  "legal_notice_copyright_line1": "Alle Texte, Bilder und sonstigen Materialien auf dieser Website sind, sofern nicht anders angegeben,",
  "legal_notice_copyright_line2": "geistiges Eigentum von Lars Schumacher. Jede unautorisierte Nutzung, Vervielfältigung oder",
  "legal_notice_copyright_line3": "Verbreitung dieser Materialien ist strengstens untersagt. Bitte kontaktieren Sie mich direkt, wenn Sie",
  "legal_notice_copyright_line4": "Inhalte verwenden möchten.",
  "privacy_policy_h1": "Datenschutzerklärung",
  "privacy_policy_h1_text1": "Diese Anwendung erhebt personenbezogene Daten von ihren Nutzern.",
  "privacy_policy_h1_text2": "Dieses Dokument kann zu Zwecken der Aufbewahrung über den Befehl „Drucken“ im Browser ausgedruckt werden.",
  "privacy_policy_h2_1": "Anbieter und Verantwortlicher",
  "privacy_policy_email": "E-Mail-Adresse des Anbieters: schumacher90lars@gmail.com",
  "privacy_policy_h2_2": "Arten der erhobenen Daten",
  "privacy_policy_h2_2_text1": "Zu den personenbezogenen Daten, die diese Anwendung selbstständig oder durch Dritte verarbeitet, gehören: E-Mail; Nutzungsdaten. Vollständige Details zu jeder Art von verarbeiteten personenbezogenen Daten werden in den dafür vorgesehenen Abschnitten dieser Datenschutzerklärung oder punktuell durch Erklärungstexte bereitgestellt, die vor der Datenerhebung angezeigt werden. Personenbezogene Daten können vom Nutzer freiwillig angegeben oder, im Falle von Nutzungsdaten, automatisch erhoben werden, wenn diese Anwendung genutzt wird. Sofern nicht anders angegeben, ist die Angabe aller durch diese Anwendung angeforderten Daten obligatorisch. Weigert sich der Nutzer, die Daten anzugeben, kann dies dazu führen, dass diese Anwendung dem Nutzer ihre Dienste nicht zur Verfügung stellen kann. In Fällen, in denen diese Anwendung die Angabe personenbezogener Daten ausdrücklich als freiwillig bezeichnet, dürfen sich die Nutzer dafür entscheiden, diese Daten ohne jegliche Folgen für die Verfügbarkeit oder die Funktionsfähigkeit des Dienstes nicht anzugeben. Nutzer, die sich darüber im Unklaren sind, welche personenbezogenen Daten obligatorisch sind, können sich an den Anbieter wenden. Jegliche Verwendung von Cookies – oder anderer Tracking-Tools – durch diese Anwendung oder Anbieter von Drittdiensten, die durch diese Anwendung eingesetzt werden, dient dem Zweck, den vom Nutzer gewünschten Dienst zu erbringen, und allen anderen Zwecken, die im vorliegenden Dokumentund in der Cookie-Richtlinie beschrieben sind.",
  "privacy_policy_h2_2_text2": "Die Nutzer sind für alle personenbezogenen Daten Dritter verantwortlich, die durch diese Anwendung beschafft, veröffentlicht oder weitergegeben werden.",
  "privacy_policy_h2_3": "Art und Ort der Datenverarbeitung",
  "privacy_policy_h2_3_text1": "Verarbeitungsmethoden Der Anbieter verarbeitet die personenbezogenen Daten der Nutzer auf ordnungsgemäße Weise und ergreift angemessene Sicherheitsmaßnahmen, um den unbefugten Zugriff und die unbefugte Weiterleitung, Veränderung oder Vernichtung von Daten zu vermeiden. Die Datenverarbeitung wird mittels Computern oder IT-basierten Systemen nach organisatorischen Verfahren und Verfahrensweisen durchgeführt, die gezielt auf die angegebenen Zwecke abstellen. Zusätzlich zum Verantwortlichen könnten auch andere Personen intern (Personalverwaltung, Vertrieb, Marketing, Rechtsabteilung, Systemadministratoren) oder extern – und in dem Fall soweit erforderlich, vom Verantwortlichen als Auftragsverarbeiter benannt (wie Anbieter technischer Dienstleistungen, Zustellunternehmen, Hosting-Anbieter, IT-Unternehmen oder Kommunikationsagenturen) - diese Anwendung betreiben und damit Zugriff auf die Daten haben. Eine aktuelle Liste dieser Beteiligten kann jederzeit vom Anbieter verlangt werden.>",
  "privacy_policy_h2_4": "Ort",
  "privacy_policy_h2_4_text1": "Die Daten werden in der Niederlassung des Anbieters und an allen anderen Orten, an denen sich die an der Datenverarbeitung beteiligten Stellen befinden, verarbeitet. Je nach Standort der Nutzer können Datenübertragungen die Übertragung der Daten des Nutzers in ein anderes Land als das eigene beinhalten. Um mehr über den Ort der Verarbeitung der übermittelten Daten zu erfahren, können die Nutzer den Abschnitt mit den ausführlichen Angaben zur Verarbeitung der personenbezogenen Daten konsultieren.",
  "privacy_policy_h2_5": "Speicherdauer",
  "privacy_policy_h2_5_text1": "Sofern in diesem Dokument nicht anderweitig festgelegt, werden personenbezogene Daten so lange verarbeitet und gespeichert, wie es der Zweck erfordert, zu dem sie erhoben wurden, und können ggf. aufgrund einer zu erfüllenden rechtlichen Verpflichtung oder basierend auf der Einwilligung des Nutzers auch länger aufbewahrt werden.",
  "privacy_policy_h2_6": "Zwecke der Verarbeitung",
  "privacy_policy_h2_6_text1": "Personenbezogene Daten über den Nutzer werden erhoben, damit der Anbieter den Dienst erbringen und des Weiteren seinen gesetzlichen Verpflichtungen nachkommen, auf Durchsetzungsforderungen reagieren, seine Rechte und Interessen (oder die der Nutzer oder Dritter) schützen, böswillige oder betrügerische Aktivitäten aufdecken kann. Darüber hinaus werden Daten zu folgenden Zwecken erhoben: Kontaktieren des Nutzers.",
  "privacy_policy_h2_7": "Weitere Informationen für Nutzer",
  "privacy_policy_h2_7_text1": "Rechtsgrundlagen der Verarbeitung Der Anbieter darf personenbezogene Daten von Nutzern nur dann verarbeiten, wenn einer der folgenden Punkte zutrifft: Die Nutzer haben ihre Einwilligung für einen oder mehrere bestimmte Zwecke erteilt. die Datenerhebung ist für die Erfüllung eines Vertrages mit dem Nutzer und/oder für vorvertragliche Maßnahmen daraus erforderlich; die Verarbeitung ist für die Erfüllung einer rechtlichen Verpflichtung, der der Anbieter unterliegt, erforderlich; die Verarbeitung steht im Zusammenhang mit einer Aufgabe, die im öffentlichen Interesse oder in Ausübung hoheitlicher Befugnisse, die dem Anbieter übertragen wurden, durchgeführt wird; die Verarbeitung ist zur Wahrung der berechtigten Interessen des Anbieters oder eines Dritten erforderlich. In jedem Fall erteilt der Anbieter gerne Auskunft über die konkrete Rechtsgrundlage, auf der die Verarbeitung beruht, insbesondere darüber, ob die Angabe personenbezogener Daten eine gesetzliche oder vertragliche Verpflichtung oder eine Voraussetzung für den Abschluss eines Vertrages ist.",
  "privacy_policy_h2_8": "Weitere Informationen zur Speicherdauer",
  "privacy_policy_h2_8_text1": "Sofern in diesem Dokument nicht anderweitig festgelegt, werden personenbezogene Daten so lange verarbeitet und gespeichert, wie es der Zweck erfordert, zu dem sie erhoben wurden, und können ggf. aufgrund einer zu erfüllenden rechtlichen Verpflichtung oder basierend auf der Einwilligung des Nutzers auch länger aufbewahrt werden.",
  "privacy_policy_h2_9": "Daher gilt:",
  "privacy_policy_h2_9_text1": "Personenbezogene Daten, die zu Zwecken der Erfüllung eines zwischen dem Anbieter und dem Nutzer geschlossenen Vertrages erhoben werden, werden bis zur vollständigen Erfüllung dieses Vertrages gespeichert. Personenbezogene Daten, die zur Wahrung der berechtigten Interessen des Anbieters erhoben werden, werden so lange aufbewahrt, wie es zur Erfüllung dieser Zwecke erforderlich ist. Nutzer können nähere Informationen über die berechtigten Interessen des Anbieters in den entsprechenden Abschnitten dieses Dokuments oder durch Kontaktaufnahme zum Anbieter erhalten. Darüber hinaus ist es dem Anbieter gestattet, personenbezogene Daten für einen längeren Zeitraum zu speichern, wenn der Nutzer in eine solche Verarbeitung eingewilligt hat, solange die Einwilligung nicht widerrufen wird. Darüber hinaus kann der Anbieter verpflichtet sein, personenbezogene Daten für einen längeren Zeitraum aufzubewahren, wenn dies zur Erfüllung einer gesetzlichen Verpflichtung oder auf Anordnung einer Behörde erforderlich ist.",
  "privacy_policy_h2_9_text2": "Nach Ablauf der Aufbewahrungsfrist werden personenbezogene Daten gelöscht. Daher können das Auskunftsrecht, das Recht auf Löschung, das Recht auf Berichtigung und das Recht auf Datenübertragbarkeit nach Ablauf der Aufbewahrungsfrist nicht geltend gemacht werden.",
  "privacy_policy_h2_9_text3": "Die Rechte der Nutzer nach der Datenschutz-Grundverordnung (DSGVO) Die Nutzer können bestimmte Rechte in Bezug auf ihre vom Anbieter verarbeiteten Daten ausüben.",
  "privacy_policy_h2_9_text4": "Nutzer haben im gesetzlich zulässigen Umfang insbesondere das Recht, Folgendes zu tun: Die Einwilligungen jederzeit widerrufen. Hat der Nutzer zuvor in die Verarbeitung personenbezogener Daten eingewilligt, so kann er die eigene Einwilligung jederzeit widerrufen. Widerspruch gegen die Verarbeitung ihrer Daten einlegen. Der Nutzer hat das Recht, der Verarbeitung seiner Daten zu widersprechen, wenn die Verarbeitung auf einer anderen Rechtsgrundlage als der Einwilligung erfolgt. Auskunft bezüglich ihrer Daten erhalten. Der Nutzer hat das Recht zu erfahren, ob die Daten vom Anbieter verarbeitet werden, über einzelne Aspekte der Verarbeitung Auskunft zu erhalten und eine Kopie der Daten zu erhalten. Überprüfen und berichtigen lassen. Der Nutzer hat das Recht, die Richtigkeit seiner Daten zu überprüfen und deren Aktualisierung oder Berichtigung zu verlangen. Einschränkung der Verarbeitung ihrer Daten verlangen. Die Nutzer haben das Recht, die Verarbeitung ihrer Daten einzuschränken. In diesem Fall wird der Anbieter die Daten zu keinem anderen Zweck als der Speicherung verarbeiten.",
  "privacy_policy_h2_10": "Löschung oder anderweitiges Entfernen der personenbezogenen Daten verlangen.",
  "privacy_policy_h2_10_text1": "Die Nutzer haben das Recht, vom Anbieter die Löschung ihrer Daten zu verlangen. Ihre Daten erhalten und an einen anderen Verantwortlichen übertragen lassen. Der Nutzer hat das Recht, seine Daten in einem strukturierten, gängigen und maschinenlesbaren Format zu erhalten und, sofern technisch möglich, ungehindert an einen anderen Verantwortlichen übermitteln zu lassen. Beschwerde einreichen. Die Nutzer haben das Recht, eine Beschwerde bei der zuständigen Aufsichtsbehörde einzureichen. Die Nutzer haben auch das Recht, sich über die Rechtsgrundlage der Datenübermittlung ins Ausland oder an eine internationale Organisation, die dem Völkerrecht unterliegt oder von zwei oder mehr Ländern gegründet wurde, wie beispielsweise die UNO, sowie sich über die vom Anbieter ergriffenen Sicherheitsmaßnahmen zum Schutz ihrer Daten aufklären zu lassen.",
  "privacy_policy_h2_11": "Details zum Widerspruchsrecht bezüglich der Verarbeitung",
  "privacy_policy_h2_11_text1": "Werden personenbezogene Daten im öffentlichen Interesse, in Ausübung eines dem Anbieter übertragenen hoheitlichen Befugnisses oder zur Wahrung der berechtigten Interessen des Anbieters verarbeitet, kann der Nutzer dieser Verarbeitung widersprechen, indem er einen Rechtfertigungsgrund angibt, der sich auf seine besondere Situation bezieht.",
  "privacy_policy_h2_11_text2": "Nutzer werden darüber informiert, dass sie der Verarbeitung der personenbezogenen Daten für Direktwerbung jederzeit unentgeltlich ohne Angabe von Gründen widersprechen können. Widerspricht der Nutzer der Verarbeitung für Zwecke der Direktwerbung, so werden die personenbezogenen Daten nicht mehr für diese Zwecke verarbeitet. Ob der Anbieter personenbezogene Daten für Direktwerbungszwecke verarbeitet, können die Nutzer den entsprechenden Abschnitten dieses Dokuments entnehmen.",
  "privacy_policy_h2_11_text3": "Wie die Rechte ausgeübt werden können Alle Anfragen zur Ausübung der Nutzerrechte können über die in diesem Dokument angegebenen Kontaktdaten an den Eigentümer gerichtet werden. Diese Anfragen können kostenlos gestellt werden und werden vom Anbieter so früh wie möglich, spätestens innerhalb eines Monats, beantwortet und den Nutzern die gesetzlich vorgeschriebenen Informationen zur Verfügung gestellt. Jede Berichtigung oder Löschung personenbezogener Daten oder die Einschränkung der Verarbeitung teilt der Anbieter allen Empfängern, denen personenbezogene Daten offengelegt wurden, mit, falls es welche gibt. Es sei denn, dies erweist sich als unmöglich oder ist mit einem unverhältnismäßigen Aufwand verbunden. Der Anbieter unterrichtet den Nutzer über diese Empfänger, wenn der Nutzer dies verlangt.",
  "privacy_policy_h2_12": "Weitere Informationen über die Erhebung und Verarbeitung von Daten",
  "privacy_policy_h2_12_text1": "Rechtliche Maßnahmen Die personenbezogenen Daten des Nutzers können vom Anbieter zu Zwecken der Rechtsdurchsetzung innerhalb oder in Vorbereitung gerichtlicher Verfahren verarbeitet werden, die sich daraus ergeben, dass diese Anwendung oder die dazugehörigen Dienste nicht ordnungsgemäß genutzt wurden. Der Nutzer erklärt, sich dessen bewusst zu sein, dass der Anbieter von den Behörden zur Herausgabe von personenbezogenen Daten verpflichtet werden könnte.",
  "privacy_policy_h2_12_text2": "Weitere Informationen über die personenbezogenen Daten des Nutzers Zusätzlich zu den in dieser Datenschutzerklärung aufgeführten Informationen kann diese Anwendung dem Nutzer auf Anfrage weitere kontextbezogene Informationen zur Verfügung stellen, die sich auf bestimmte Dienste oder auf die Erhebung und Verarbeitung personenbezogener Daten beziehen.",
  "privacy_policy_h2_13": "Systemprotokolle und Wartung",
  "privacy_policy_h2_13_text1": "Diese Anwendung und die Dienste von Dritten können zu Betriebs- und Wartungszwecken Dateien erfassen, die die über diese Anwendung stattfindende Interaktion aufzeichnen (Systemprotokolle), oder andere personenbezogene Daten (z. B. IP-Adresse) zu diesem Zweck verwenden.",
  "privacy_policy_h2_14": "Nicht in dieser Datenschutzerklärung enthaltene Informationen",
  "privacy_policy_h2_14_text1": "Weitere Informationen über die Erhebung oder Verarbeitung personenbezogener Daten können jederzeit vom Anbieter über die aufgeführten Kontaktangaben angefordert werden.",
  "privacy_policy_h2_15": "Änderungen dieser Datenschutzerklärung",
  "privacy_policy_h2_15_text1": "Der Anbieter behält sich vor, jederzeit Änderungen an dieser Datenschutzerklärung vorzunehmen, indem Nutzer auf dieser Seite und gegebenenfalls über diese Anwendung und/oder - soweit technisch und rechtlich möglich – durch das Versenden einer Mitteilung über dem Anbieter vorliegende Kontaktdaten der Nutzer informiert werden. Nutzern wird daher nahegelegt, diese Seite regelmäßig aufzurufen und insbesondere das am Seitenende angegebene Datum der letzten Änderung zu prüfen.",
  "privacy_policy_h2_15_text2": "Soweit Änderungen eine auf der Einwilligung des Nutzers basierte Datennutzung betreffen, so wird der Anbieter - soweit erforderlich - eine neue Einwilligung einholen.",
  "privacy_policy_last_update": "Letzte Aktualisierung: 20. November 2024"  
}
