{
  "about_me": "About me",
  "skills": "Skills",
  "contact": "Contact",
  "legal_notice": "Legal Notice",
  "job_title": "Frontend Developer",
  "lets_talk": "Let's talk!",
  "scroll_down": "scroll down",
  "intro_line1": "Hi, I’m a german speaking Frontend Developer based near",
  "intro_line2": "Mönchengladbach. Motivated by the limitless opportunities",
  "intro_line3": "within IT, I am excited about crafting visually captivating",
  "intro_line4": "and intuitive websites and applications.",
  "location_line1": "Flexible in terms of working environments, I can",
  "location_line2": "work effectively both on-site in",
  "location_line3": "Mönchengladbach and remotely.",
  "bulb_line1": "I am open-minded and always looking for",
  "bulb_line2": "personal challenges to constantly improve",
  "bulb_line3": "my knowledge and skills.",
  "puzzle_line1": "In my profession, programming isn't just about",
  "puzzle_line2": "writing code; it's a creative form of",
  "puzzle_line3": "problem-solving. I take pride in my ability to",
  "puzzle_line4": "distill complex technical challenges into simple,",
  "puzzle_line5": "user-friendly solutions. This way, I help you",
  "puzzle_line6": "achieve your goals and bring your visions to life.",
  "learning": "I'm currently learning backend to become a full stack developer",
  "my_skills": "My skills",
  "skills_intro_line1": "I have gained experience in building projects with different",
  "skills_intro_line2": "frontend technologies and concepts.",
  "looking_for": "Looking for",
  "another_skill": "another skill",
  "learn_more_line1": "Feel free to contact me. I look forward to expanding",
  "learn_more_line2": "on my previous knowledge.",
  "get_in_touch": "Get in touch",
  "portfolio_explore": "Explore a selection of my work here - Interact with projects to see my skills in action.",
  "portfolio": {
    "join": {
      "description": "A Kanban-inspired task manager. Create and organize tasks using drag-and-drop functions, assign users and categories."
    },
    "medieval_hunt": {
      "description": "A simple Jump-and-Run game based on an object-oriented approach. Help the magician collect the coins and make his way to the end. Watch your mana otherwise it will be difficult to defeat the boss."
    }
  },
  "contact_h2": "Got a problem to solve?",
  "contact_me_line1": "Contact me through this form, I am interested in hearing",
  "contact_me_line2": "from you, knowing your ideas and contributing to your",
  "contact_me_line3": "projects with my work.",
  "contact_me_line4": "Need a Frontend developer?",
  "contact_me": "Contact me!",
  "contact_form_name": "Your name",
  "contact_form_name_required": "Your name is required!",
  "contact_form_email": "Your email",
  "contact_form_email_required": "Your email is required!",
  "contact_form_message": "Your message",
  "contact_form_message_required": "Your message is empty!",
  "privacy_policy_before": "I've read the",
  "privacy_policy": "privacy policy",
  "privacy_policy_after": "and agree to the processing of my data as outlined.",
  "privacy_policy_required": "Please accept the privacy policy!",
  "submit_btn": "Send message",
  "message_response": "Message sent successfully.",
  "legal_notice_h1": "Information according to § 5 TMG (Telemedia Act)",
  "legal_notice_h2": "Owner & Content Responsibility:",
  "legal_notice_location": "Germany",
  "legal_notice_contact_info": "Contact Information:",
  "legal_notice_phone": "Phone: +49 173 4216923",
  "legal_notice_h2_info": "Disclaimer:",
  "legal_notice_info_line1": "This website is part of a personal portfolio and is intended solely for showcasing professional",
  "legal_notice_info_line2": "projects and experience. While every effort is made to ensure the accuracy and completeness of",
  "legal_notice_info_line3": "the information provided, I assume no liability for external links or for content that may be",
  "legal_notice_info_line4": "outdated, incomplete, or inaccurate. Links to third-party sites are provided solely for",
  "legal_notice_info_line5": "informational purposes; the responsibility for these external websites lies with their respective operators.",
  "legal_notice_h2_copyright": "Copyright:",
  "legal_notice_copyright_line1": "All texts, images, and other materials on this website are the",
  "legal_notice_copyright_line2": "intellectual property of Lars Schumacher, unless otherwise noted. Any",
  "legal_notice_copyright_line3": "unauthorized use, reproduction, or distribution of these materials is",
  "legal_notice_copyright_line4": "strictly prohibited. Please contact me directly if you wish to use any content.",
  "privacy_policy_h1": "Privacy Policy",
  "privacy_policy_h1_text1": "This application collects personal data from its users.",
  "privacy_policy_h1_text2": "This document can be printed for storage purposes using the 'Print' command in the browser.",
  "privacy_policy_h2_1": "Provider and Responsible Party",
  "privacy_policy_email": "Provider's email address: schumacher90lars@gmail.com",
  "privacy_policy_h2_2": "Types of Collected Data",
  "privacy_policy_h2_2_text1": "The personal data processed by this application, either independently or through third parties, include: Email; Usage data. Complete details on each type of processed personal data are provided in the relevant sections of this Privacy Policy or through explanatory texts displayed prior to data collection. Personal data may be voluntarily provided by the user or, in the case of usage data, automatically collected when this application is used. Unless stated otherwise, providing all the data requested by this application is mandatory. Refusing to provide such data may prevent the application from providing its services to the user. In cases where the application explicitly states that the provision of personal data is voluntary, users have the option not to provide such data without any impact on the availability or functionality of the service. Users who are unsure about which personal data is mandatory may contact the provider. Any use of cookies – or other tracking tools – by this application or third-party service providers utilized by this application is for the purpose of delivering the service requested by the user and for all other purposes described in this document and the Cookie Policy.",
  "privacy_policy_h2_2_text2": "Users are responsible for all personal data of third parties that are collected, published, or shared through this application.",
  "privacy_policy_h2_3": "Type and Location of Data Processing",
  "privacy_policy_h2_3_text1": "Processing Methods The provider processes users' personal data in a lawful manner and takes appropriate security measures to prevent unauthorized access, disclosure, alteration, or destruction of data. Data processing is carried out using computers or IT-based systems according to organizational procedures and practices that are specifically designed for the stated purposes. In addition to the data controller, other individuals may also be involved internally (such as human resources, sales, marketing, legal department, system administrators) or externally – and in such cases, where necessary, designated by the controller as data processors (such as providers of technical services, delivery companies, hosting providers, IT companies, or communication agencies) – who may operate this application and have access to the data. A current list of these parties can be requested from the provider at any time.",
  "privacy_policy_h2_4": "Location",
  "privacy_policy_h2_4_text1": "The data is processed at the provider's headquarters and at any other locations where the parties involved in the data processing are located. Depending on the user’s location, data transfers may involve transferring the user’s data to a country other than their own. To learn more about the location of the processing of transferred data, users can refer to the section detailing the processing of personal data.",
  "privacy_policy_h2_5": "Retention Period",
  "privacy_policy_h2_5_text1": "Unless otherwise stated in this document, personal data is processed and stored for as long as required to fulfill the purpose for which it was collected and may, if necessary, be retained for a longer period to comply with legal obligations or based on the user’s consent.",
  "privacy_policy_h2_6": "Purposes of Processing",
  "privacy_policy_h2_6_text1": "Personal data about the user is collected to enable the provider to deliver the service, comply with legal obligations, respond to enforcement requests, protect its rights and interests (or those of users or third parties), and detect malicious or fraudulent activities. Additionally, data is collected for the following purposes: contacting the user.",
  "privacy_policy_h2_7": "Additional Information for Users",
  "privacy_policy_h2_7_text1": "Legal Basis for Processing. The provider is permitted to process users' personal data only if one of the following applies: - The users have given their consent for one or more specific purposes; - Data collection is necessary for the performance of a contract with the user and/or for pre-contractual obligations related to it; - Processing is necessary for compliance with a legal obligation to which the provider is subject; - Processing is related to a task carried out in the public interest or in the exercise of official authority vested in the provider; - Processing is necessary for the purposes of the legitimate interests pursued by the provider or a third party. In any case, the provider will gladly clarify the specific legal basis applicable to the processing, particularly whether the provision of personal data is a statutory or contractual requirement or a necessary prerequisite for entering into a contract.",
  "privacy_policy_h2_8": "Additional Information on Retention Period",
  "privacy_policy_h2_8_text1": "Unless otherwise specified in this document, personal data is processed and stored for as long as necessary to fulfill the purpose for which it was collected and may be retained for a longer period if required to comply with a legal obligation or based on the user’s consent.",
  "privacy_policy_h2_9": "Therefore, the following applies:",
  "privacy_policy_h2_9_text1": "Personal data collected for the purpose of fulfilling a contract between the provider and the user will be stored until the full completion of that contract. Personal data collected to safeguard the legitimate interests of the provider will be retained as long as necessary to fulfill these purposes. Users can obtain more information about the provider’s legitimate interests in the relevant sections of this document or by contacting the provider. Furthermore, the provider is permitted to store personal data for a longer period if the user has consented to such processing, as long as the consent is not withdrawn. Additionally, the provider may be required to retain personal data for a longer period if necessary to fulfill a legal obligation or by order of an authority.",
  "privacy_policy_h2_9_text2": "After the retention period has expired, personal data will be deleted. Therefore, the right to access, the right to deletion, the right to correction, and the right to data portability cannot be exercised after the retention period has ended.",
  "privacy_policy_h2_9_text3": "Users' Rights under the General Data Protection Regulation (GDPR) Users can exercise certain rights regarding their data processed by the provider.",
  "privacy_policy_h2_9_text4": "Nutzer haben im gesetzlich zulässigen Umfang insbesondere das Recht, Folgendes zu tun: Die Einwilligungen jederzeit widerrufen. Hat der Nutzer zuvor in die Verarbeitung personenbezogener Daten eingewilligt, so kann er die eigene Einwilligung jederzeit widerrufen. Widerspruch gegen die Verarbeitung ihrer Daten einlegen. Der Nutzer hat das Recht, der Verarbeitung seiner Daten zu widersprechen, wenn die Verarbeitung auf einer anderen Rechtsgrundlage als der Einwilligung erfolgt. Auskunft bezüglich ihrer Daten erhalten. Der Nutzer hat das Recht zu erfahren, ob die Daten vom Anbieter verarbeitet werden, über einzelne Aspekte der Verarbeitung Auskunft zu erhalten und eine Kopie der Daten zu erhalten. Überprüfen und berichtigen lassen. Der Nutzer hat das Recht, die Richtigkeit seiner Daten zu überprüfen und deren Aktualisierung oder Berichtigung zu verlangen. Einschränkung der Verarbeitung ihrer Daten verlangen. Die Nutzer haben das Recht, die Verarbeitung ihrer Daten einzuschränken. In diesem Fall wird der Anbieter die Daten zu keinem anderen Zweck als der Speicherung verarbeiten.",
  "privacy_policy_h2_10": "Request the deletion or other removal of personal data.",
  "privacy_policy_h2_10_text1": "Users have the right, to the extent permitted by law, to do the following: -Withdraw consent at any time**: If the user has previously consented to the processing of their personal data, they can withdraw their consent at any time. - **Object to the processing of their data**: The user has the right to object to the processing of their data if the processing is based on a legal basis other than consent. - **Obtain information about their data**: The user has the right to know whether their data is being processed by the provider, to receive information about specific aspects of the processing, and to obtain a copy of their data. - **Verify and request correction**: The user has the right to verify the accuracy of their data and request its update or correction. - **Request restriction of the processing of their data**: Users have the right to request the restriction of the processing of their data. In this case, the provider will process the data only for storage purposes.",
  "privacy_policy_h2_11": "Details on the Right to Object to Processing",
  "privacy_policy_h2_11_text1": "If personal data is processed in the public interest, in the exercise of an official authority vested in the provider, or to safeguard the legitimate interests of the provider, the user may object to such processing by providing a justification related to their specific situation.",
  "privacy_policy_h2_11_text2": "Users are informed that they can object to the processing of their personal data for direct marketing purposes at any time, free of charge and without providing any reasons. If the user objects to processing for direct marketing purposes, their personal data will no longer be processed for these purposes. Users can find out whether the provider processes personal data for direct marketing purposes in the relevant sections of this document.",
  "privacy_policy_h2_11_text3": "How to Exercise Rights All requests to exercise user rights can be directed to the provider using the contact details provided in this document. These requests can be made free of charge and will be addressed by the provider as soon as possible, and in any case within one month, providing the user with the legally required information. Any correction, deletion of personal data, or restriction of processing will be communicated by the provider to all recipients to whom the personal data has been disclosed, if any. Unless this proves to be impossible or involves disproportionate effort. The provider will inform the user about these recipients upon request.",
  "privacy_policy_h2_12": "Further Information on the Collection and Processing of Data",
  "privacy_policy_h2_12_text1": "Legal Actions The user's personal data may be processed by the provider for the purposes of legal enforcement within or in preparation for legal proceedings that arise from the improper use of this application or its associated services. The user acknowledges that the provider may be obligated by authorities to disclose personal data.",
  "privacy_policy_h2_12_text2": "Further Information on the User's Personal Data In addition to the information provided in this privacy policy, this application may, upon request, provide the user with further contextual information related to specific services or to the collection and processing of personal data.",
  "privacy_policy_h2_13": "System Logs and Maintenance",
  "privacy_policy_h2_13_text1": "This application and third-party services may collect files for operational and maintenance purposes that record interactions occurring through this application (system logs) or use other personal data (e.g., IP address) for this purpose.",
  "privacy_policy_h2_14": "Information Not Contained in This Privacy Policy",
  "privacy_policy_h2_14_text1": "Further information about the collection or processing of personal data can be requested at any time from the provider using the contact details provided.",
  "privacy_policy_h2_15": "Changes to This Privacy Policy",
  "privacy_policy_h2_15_text1": "The provider reserves the right to make changes to this privacy policy at any time by notifying users on this page and, where technically and legally possible, by sending a notification through the contact details provided by the provider. Users are therefore encouraged to regularly review this page and, in particular, check the date of the last update provided at the bottom of the page.",
  "privacy_policy_h2_15_text2": "If changes affect the use of data based on the user's consent, the provider will obtain a new consent from the user, where necessary.",
  "privacy_policy_last_update": "Last updated: November 20, 2024"  
}
